package variable;

public class Var8 {

    public static void main(String[] args) {
        //정수
        byte b = 127;       //-128 ~ 127        (메모리 공간 크기 : 2의 8승)
        short s = 32767;    // -32,768 ~ 32,767 (메모리 공간 크기 : 2의 16승)
        int i = 2147483647; //-2,147,483,648 ~ 2,147,483,647 (메모리 공간 크기 : 2의 32승 약 20억)

        //-9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807
        long l = 9223372036854775807L;  // (메모리 공간 크기 : 2의 64승)

        //실수 (실무에서 dobule 사용)
        float f = 10.0f; // 7자리 정밀도 4byte,   메모리 공간 크기 2의 32승
        double d = 10.0; // 15자리 정밀도 8byte,  메모리 공간 크기 2의 64승

        //기타
        // boolean, char : 1byte
        // String 길이에 따라 다름

    }
}
